// การวนลูบในภาษา Go มีเพียงการใช้ `for` เท่านั้น<br/>
// มาดูตัวอย่างการใช้งานขั้นพื้นฐาน 3 รูปแบบกัน

package main

import "fmt"

func main() {

    // การใช้งานส่วนใหญ่ ทำการตรวจสอบเพียงเงื่อนไขเดียว
    i := 1
    for i <= 3 {
        fmt.Println(i)
        i = i + 1
    }

    // กำหนดค่าเริ่มต้น เงื่อนไข และการเพิ่มค่าหลังจากทำงานเสร็จในแต่ละรอบ
    for j := 7; j <= 9; j++ {
        fmt.Println(j)
    }

    // ถ้าในลูบ `for` ไม่มีการตรวจสอบเงื่อนไข<br/>
    // จะหยุดทำงานเมื่อเจอคำสั่ง `break` หรือ `return`

    for {
        fmt.Println("loop")
        break
    }
}
