// ในภาษา Go นั้น นักพัฒนาต้องทำการประกาศตัวแปรขึ้นมา<br/>
// ซึ่งตัวแปรเหล่านี้จะถูกใช้งานจาก compiler ของภาษา<br/>
// เช่น ตรวจสอบว่าทำงานถูกต้องตามชนิดของมันหรือไม่

package main

import "fmt"

func main() {

    // `var` ใช้สำหรับการประกาศตัวแปรตั้งแต่ 1 ตัวขึ้นไป
    var a string = "initial"
    fmt.Println(a)

    // สามารถกำหนดค่าของหลายตัวแปร ได้พร้อม ๆ กัน
    var b, c int = 1, 2
    fmt.Println(b, c)

    // ถ้าไม่ทำการกำหนดชนิดของตัวแปรแล้ว<br/>
    // ภาษา Go จะอ้างถึงชนิดของตัวแปร จากค่าเริ่มต้นที่กำหนดให้
    var d = true
    fmt.Println(d)

    // ถ้าตัวแปรที่ประกาศขึ้นมา โดยไม่กำหนดค่าเริ่มต้นแล้ว<br/>
    // ภาษา Go จะทำการกำหนดค่าเริ่มต้นด้วย <a href="https://golang.org/ref/spec#The_zero_value">Zero value</a> ให้อัตโนมัติ
    // ตัวอย่างเช่น ค่า zero value ของ `int` คือ `0`

    var e int
    fmt.Println(e)

    // สามารถสร้างตัวแปร และ กำหนดค่าเริ่มต้นแบบสั้น ๆ ด้วย `:=` <br/>
    // ซึ่งทำให้การเขียน code ง่าย และ สะดวกขึ้น
    f := "short"
    fmt.Println(f)
}
